"""ცვლადების გამოყენებით დაბეჭდეთ თქვენი სახელი და გვარი, შემდეგ დაბეჭდეთ 3 მათემატიკური ოპერაციის (+,-,*) შედეგი და თქვენი ჰობი, ყველაფერი ახსენით კომენტარებით ქართულად და ცვლადებს სახელები დაარქვით snake_case-ის სტილში (გამოიყენეთ სტანდარტები და საუკეთესო პრაქტიკები)"""

#ვბეჭდავთ ჩემს სახელსა და გვარს
full_name="Nika Monaselidze"

#გამოგვაქვს ჩემი სახელი
print(full_name)

#ვაკეთებთ მათემატიკურ მოქმედებებს
print(5+10)
print(100-32)
print(100*100)

#ვბეჭდავთ ჩემს ჰობის
my_hobby="programming"
print(my_hobby)