"""მომხმარებელს შემოატანინეთ მისი სახელი, შემოატანინეთ მისი ასაკი, ასევე სიმაღლე და შეამოწმეთ თუ მომხმარებლის ასაკი მეტია 18 და მისი სახელი უდრის თქვენს სახელს და ასევე მისი სიმაღლე მეტია 1.80-ზე
"""
my_name = "Nika"
name = input("Enter Your Name")
age = input("Enter Your Age")
height = input("Enter Your Height")

print(name <= my_name)
print(age>18)
print(height>1.80)

#ალგორითმი არის იგივე თანმიმდევრობა რომელიც რეალურ ცხოვრებაშიც გამოიყენება, მაგ:ტორტის გამოცხობა, რაიმე კონსტრუქციის აწყობა, დღის რუტინა და ა.შ.